Revit 2027 API
ScheduleDefinition.GetSortGroupFields Method
 Gets all sorting/grouping fields in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ScheduleSortGroupField> GetSortGroupFields()
Public Function GetSortGroupFields As IList(Of ScheduleSortGroupField)
public:
IList<ScheduleSortGroupField^>^ GetSortGroupFields()
member GetSortGroupFields : unit -> IList<ScheduleSortGroupField>
Return Value
IList<ScheduleSortGroupField>
 A list of all sorting/grouping fields.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace